Term4/matlog/lectures/3.tex
% Created 2021-04-20 Tue 00:26
% Intended LaTeX compiler: pdflatex

\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{lipsum}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}
\usetikzlibrary{automata, arrows}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}
\newcommand{\llb}{\llbracket}
\newcommand{\rrb}{\rrbracket}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\A}{\mathfrak{A}}
\newcommand{\B}{\mathfrak{B}}
\newcommand{\rank}{\mathop{\rm rank}\nolimits}
\newcommand{\const}{\var{const}}
\newcommand{\grad}{\mathop{\rm grad}\nolimits}

\newcommand{\todo}{{\color{red}\fbox{\text{Доделать}}}}
\newcommand{\fixme}{{\color{red}\fbox{\text{Исправить}}}}

\newcounter{propertycnt}
\setcounter{propertycnt}{1}
\newcommand{\beginproperty}{\setcounter{propertycnt}{1}}

\theoremstyle{plain}
\newtheorem{propertyinner}{Свойство}
\newenvironment{property}{
  \renewcommand\thepropertyinner{\arabic{propertycnt}}
  \propertyinner
}{\endpropertyinner\stepcounter{propertycnt}}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother

\newenvironment{rualgo}[1][]
  {\begin{algorithm}[#1]
     \selectlanguage{russian}%
     \floatname{algorithm}{Алгоритм}%
     \renewcommand{\algorithmicif}{{\color{red}\textbf{если}}}%
     \renewcommand{\algorithmicthen}{{\color{red}\textbf{тогда}}}%
     \renewcommand{\algorithmicelse}{{\color{red}\textbf{иначе}}}%
     \renewcommand{\algorithmicend}{{\color{red}\textbf{конец}}}%
     \renewcommand{\algorithmicfor}{{\color{red}\textbf{для}}}%
     \renewcommand{\algorithmicto}{{\color{red}\textbf{до}}}%
     \renewcommand{\algorithmicdo}{{\color{red}\textbf{делать}}}%
     \renewcommand{\algorithmicwhile}{{\color{red}\textbf{пока}}}%
     \renewcommand{\algorithmicrepeat}{{\color{red}\textbf{повторять}}}%
     \renewcommand{\algorithmicuntil}{{\color{red}\textbf{до тех пор пока}}}%
     \renewcommand{\algorithmicloop}{{\color{red}\textbf{повторять}}}%
     \renewcommand{\algorithmicnot}{{\color{blue}\textbf{не}}}%
     \renewcommand{\algorithmicand}{{\color{blue}\textbf{и}}}%
     \renewcommand{\algorithmicor}{{\color{blue}\textbf{или}}}%
     \renewcommand{\algorithmicrequire}{{\color{blue}\textbf{Ввод}}}%
     \renewcommand{\algorithmicensure}{{\color{blue}\textbf{Вывод}}}%
     \renewcommand{\algorithmicreturn}{{\color{red}\textbf{Вернуть}}}%
     \renewcommand{\algorithmicrtrue}{{\color{blue}\textbf{истинна}}}%
     \renewcommand{\algorithmicrfalse}{{\color{blue}\textbf{ложь}}}%
     % Set other language requirements
  }
  {\end{algorithm}}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 3}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Правила вывода}
\label{sec:org0c24281}
Сверху посылки, снизу заключения
\begin{itemize}
\item Аксиома
\[ \frac{}{\Gamma, \varphi \vdash \varphi} \]
\item Введение \(\to\)
\[ \frac{\Gamma, \varphi \vdash \psi}{\Gamma \vdash \varphi \to \psi} \]
\item Удаление \(\to\)
\[ \frac{\Gamma \vdash \varphi \to \psi\quad \Gamma \vdash \varphi}{\Gamma \vdash \psi} \]
\item Введение \(\&\)
\[ \frac{\Gamma \vdash \varphi \quad \Gamma \vdash \psi}{\Gamma \vdash \varphi \& \psi} \]
\item Удаление \(\&\)
\[ \frac{\Gamma \vdash \varphi \& \psi}{\Gamma \vdash \varphi} \]
\[ \frac{\Gamma \vdash \varphi \& \psi}{\Gamma \vdash \psi} \]
\item Введение \(\vee\)
\[ \frac{\Gamma \vdash \varphi}{\Gamma \vdash \varphi \vee \psi} \]
\[ \frac{\Gamma \vdash \psi}{\Gamma \vdash \varphi \vee \psi} \]
\item Удалние \(\vee\)
\[ \frac{\Gamma, \varphi \vdash \rho \quad \Gamma, \psi \vdash \rho \quad \Gamma \vdash \varphi \vee \psi}{\Gamma \vdash \rho} \]
\item Удаление \(\perp\)
\[ \frac{\Gamma \vdash \perp}{\Gamma \vdash \varphi} \]
\end{itemize}
\begin{examp}
\[ \frac{\displaystyle\frac{}{A \vdash A}(\text{акс.})}{\vdash A \to A}(\text{вв. }\to) \]
\end{examp}
\begin{examp}
Докажем \(\frac{}{\vdash A \& B \to B \& A}\)
\[ \frac{\displaystyle\frac{\displaystyle\frac{\displaystyle\frac{}{A \& B \vdash A \& B}(\text{акс.})}{A\& B \vdash B}(\text{уд. } \&) \quad \frac{\displaystyle\frac{}{A \& B \vdash A \& B}(\text{акс.})}{A \& B \vdash A}(\text{уд. } \&)}{A\&B \vdash B \& A}(\text{вв. } \&)}{\vdash A \& B \to B & A}(\text{вв. }\to) \]
\end{examp}
\begin{definition}
Фиксируем \(A\) \\
Частичный порядок --- антисимметричное, транзитивное, рефлексивное отношение \\
Линейный --- сравнимы любые 2 элемента \\
\begin{itemize}
\item \(a \le b \vee b \le a\)
\item \textbf{Наименьший элемент} \(S\) --- такой \(k \in S\), что если \(x \in S\), то \(k \le x\)
\item \textbf{Минимальный элемент} \(S\) --- такой \(k \in S\), что нет \(x \in S\), что \(x \le k\)
\end{itemize}
\end{definition}
\begin{examp}
\-
\begin{center}
\begin{tikzcd}
\([9, 9 , 9]\) \arrow{d} \arrow{dr} &  & \([1, 2, 1]\) \arrow{dll} \arrow{dl} \arrow{d} \\
\([1, 0 , 0]\) & \([0, 1, 0]\) & \([0, 0, 1]\)
\end{tikzcd}
\end{center}
Нет наименьшего, но есть 3 минимальных. Стрелка из \(a\) в \(b\) обозначает \(b \le a\)
\end{examp}
\begin{definition}
\-
\begin{itemize}
\item \textbf{Множество верхних граней} \(a\) и \(b\): \(\{x \big| a \le x \& b \le x\}\)
\item \textbf{Множество нижних граней} \(a\) и \(b\): \(\{x \big| x \le a \& x \le b\}\)
\end{itemize}
\end{definition}
\begin{definition}
\-
\begin{itemize}
\item \textbf{\(a + b\)} --- нименьший элемент множества верхних граней
\item \textbf{\(a \cdot b\)} --- наибольший элемент множества нижних граней
\end{itemize}
\end{definition}
\begin{definition}
\textbf{Решетка} = \(\langle A, \le \rangle\) --- структура, где для каждых \(a, b\) есть как \(a + b\), так и \(a \cdot b\), \\
т.е. \(a \in A, b \in B \implies a + b \in A\) и \(a \cdot b \in A\)
\end{definition}
\begin{definition}
\textbf{Дистрибутивная решетка} если всегда  \(a \cdot (b + c) = a\codt b + a \cdot c\)
\end{definition}
\begin{lemma}
В дистрибутивной решетке \(a + b\cdot c = (a + b) \cdot(a + c)\)
\end{lemma}
\begin{definition}
\textbf{Псевдодополнение} \(a \to b = \text{наиб.}\{c \big| a \cdot c \le b\}\)
\end{definition}
\begin{definition}
\textbf{Импликативная решетка} --- решетка, где для любых \(a, b\) есть \(a \to b\)
\end{definition}
\begin{definition}
\textbf{0} --- наименьший элемент решетки, \textbf{1} --- наибольший элемент решетки
\end{definition}
\begin{definition}
\textbf{Псевдобулева алгебра (алгебра Гейтинга)} --- импликативная решетка с \(0\)
\end{definition}
\begin{definition}
\textbf{Булева алгебра} --- псевдобулева алгебра, такая что \(a + (a \to 0) = 1\)
\end{definition}
\begin{examp}
\-
\begin{center}
\begin{tikzpicture}
\node (A) at (0, 0) {\(1\)};
\node (B) at (-1, -1) {\(a\)};
\node (C) at (1, -1) {\(b\)};
\node (D) at (0, -2) {\(0\)};
\draw[->] (A) -- (B);
\draw[->] (A) -- (C);
\draw[->] (B) -- (D);
\draw[->] (C) -- (D);
\end{tikzpicture}
\end{center}
\begin{itemize}
\item \(a \cdot 0 = 0\)
\item \(1\cdot b = b\)
\item \(a \cdot b = 0\)
\item \(a + b = 1\)
\item \(a \to b = \text{наиб.}\{x \big| a\cdot x \le b\} = b\) \\
\(\{x \big| a \cdot x \le \} = \{0, b\}\)
\item \(a \to 1 = 1\)
\item \(a \to 0 = 0\)
\end{itemize}
Можем представить в виде пары \(\langle x, y \rangle\)
\begin{itemize}
\item \(a = \langle 1, 0 \rangle\)
\item \(b = \langle 0 , 1\rangle\)
\item \(1 = \langle 1, 1 \rangle\)
\item \(0 = \langle 0, 0 \rangle\)
\end{itemize}
\end{examp}
\begin{lemma}
В импликативной решетке всегда есть \(1\).
\end{lemma}
\begin{theorem}
Любая алгебра Гейтинга --- модель ИИВ
\end{theorem}
\begin{theorem}
Любая булева алгебра --- модель КИВ
\end{theorem}
\begin{defintion}
Рассмотрим множество \(X\) --- \textbf{носитель}. Рассмотрим \(\Omega \subseteq 2^X\) --- подмножество подмножеств \(X\) --- \textbf{топология}.
\begin{enumerate}
\item \(\bigcup X_i \in \Omega\), где \(X_i \in \Omega\)
\item \(X_1 \cap \dots \cap X_n \in \Omega\), если \(X_i \in \Omega\)
\item \(\emptyset, X \in \Omega\)
\end{enumerate}
\end{defintion}
\begin{theorem}
\-
\begin{itemize}
\item \(a + b = a \cup b\)
\item \(a \cdot b = a \cap b\)
\item \(a \to b = \left((X \setminus a) \cup b\right)^\circ\)
\item \(a \le b\) тогда и только тогда, когда \(a \subseteq b\)
\end{itemize}
\uline{Тогда} \(\langle \Omega, \le \rangle\) --- алгебра Гейтинга
\end{theorem}
\begin{definition}
\(X\) --- все формулы логики
\begin{itemize}
\item \(\alpha \le \beta\) --- это \(\alpha \vdash \beta\)
\item \(\alpha \approx \beta\), если \(\alpha \vdash \beta\) и \(\beta \vdash \alpha\)
\item \([\alpha]_\approx = \{\gamma \big| \gamma \approx \alpha\}\) --- класс эквивалентности
\end{itemize}
\end{definition}
\beginproperty
\begin{property}
\(\langle X/_\approx, \le \rangle\) --- алгебра Гейтинга, где \(X/_\approx = \{[\alpha]_\approx \big| \alpha \in X\}\)
\end{property}
\begin{theorem}
Алгебра гейтинга --- полная модель ИИВ
\end{theorem}
\end{document}
